In [1]:
import pandas as pd

In [2]:
pd.read_excel(r'C:\Users\smita\Desktop\student surve.xlsx')

     Unnamed: 0 Unnamed: 1 Unnamed: 2   Unnamed: 3
0  student name     father     mother  student age
1          riya     tanaji      radha           12
2         swara    shahaji     resham           11
3         priya      sohil     monali           12
4         kaira        ram     khushi           11
5       samidha      ashok     sanali           11
6          sonu       amar   harshali           10

In [4]:
pd.read_csv(r'C:\Users\smita\Desktop\city.tsv',sep='\t')

     name  contact number city Unnamed: 2
0     ram           5567789898     nagpur
1   radha           9787766544     mumbai
2  sarika           7766655451        goa
3    mona           9887867661     satara